#include <stdio.h>
#include <string.h>

struct student //student 구조체 정의
{
    char name[50];
    char ph[50];
    char add[50];
    int id;
    double score;
    char major[50];
    char path[50];
    char proname[50];
    char proph[50];
    char proadd[50];
};

int main() {
    struct student p[10] = {
        { "김철수", "01012341111", "서울", 20231101, 3.6, "수학", "교수", "Prof.Lee", "01012341230", "서울"},
        { "김현수", "01012342222", "경기도", 20231102, 3.8, "화학", "선생님", "Prof.Kim", "01012341231", "경기도"},
        { "김민수", "01012343333", "대구", 20231103, 3.5, "물리", "과학자", "Prof.Hong", "01012341232", "대구"},
        { "김진수", "01012344444", "부산", 20231104, 3.7, "생명", "연구자", "Prof.Jin", "01012341233", "부산"},
        { "이선희", "01012345555", "제주도", 20231105, 3.4, "컴퓨터", "엔지니어", "Prof.Tom", "01012341234", "제주도"},
        { "우지수", "01012346666", "미국", 20231106, 3.9, "영어", "선생님", "Prof.Na", "01012341235", "미국"},
        { "이민기", "01012347777", "영국", 20231107, 3.2, "국어", "작가", "Prof.James", "01012341236", "영국"},
        { "권현기", "01012348888", "인천", 20231108, 3.3, "패션", "디자이너", "Prof.Nick", "01012341237", "인천"},
        { "홍길동", "01012349999", "울산", 20231109, 3.1, "미디어", "방송피디", "Prof.Kwon", "01012341238", "울산"},
        { "홍준영", "01012340000", "일본", 20231110, 3.4, "전자공학", "엔지니어", "Prof.Sun", "01012341239", "일본"}
    }; //student 정보 초기화

    //student 정보 출력
    printf("학생 정보 출력:\n");
    for (int i = 0; i < 10; i++) {
        printf("학생 %d 정보:\n", i + 1);
        printf("이름: %s\n", p[i].name);
        printf("전화번호: %s\n", p[i].ph);
        printf("주소: %s\n", p[i].add);
        printf("학번: %d\n", p[i].id);
        printf("평균 평점: %.2lf\n", p[i].score);
        printf("학과: %s\n", p[i].major);
        printf("진로: %s\n", p[i].path);
        printf("지도 교수 이름: %s\n", p[i].proname);
        printf("지도 교수 전화번호: %s\n", p[i].proph);
        printf("지도 교수 주소: %s\n", p[i].proadd);
        printf("\n");
    }
    return 0;
}